Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/c-api.tmx
Source language: en
Languages: pl

source: Abstract Objects Layer
pl: Płaszczyzna przedmiotów ogólnych

source: The functions in this chapter interact with Python objects regardless of their type, or with wide classes of object types (e.g. all numerical types, or all sequence types). When used on object types for which they do not apply, they will raise a Python exception.
pl: Zadania opisane w tym rozdziale oddziałują na przedmioty napisane w pytonowskim języku bez względu na ich typ, lub też na różnorodne rodzaje typów przedmiotów (np. wszystkie typy liczbowe, lub wszystkie typy kolejkowe). Gdy użyte z przedmiotami niezgodnego typu zadania zgłaszają wyjątki pytonowskiego języka.

source: It is not possible to use these functions on objects that are not properly initialized, such as a list object that has been created by :cfunc:`PyList_New`, but whose items have not been set to some non-\ ``NULL`` value yet.
pl: Nie jest możliwe wykonanie tych zadań na przedmiotach, które nie zostały poprawnie zapoczątkowane, takimi, jak np. lista - utworzona przy użyciu :cfunc:`PyList_New`, której pozycje nie były jeszcze uzupełnione jakimiś wartościami znacząco odróżniającymi się od ``NULL``.

source: Allocating Objects on the Heap
pl: Przydział miejsca dla przedmiotów w stercie

source: See also
pl: Zobacz też:

source: To allocate and create extension modules.
pl: Aby umieścić i utworzyć moduły rozszerzające.

source: Parsing arguments and building values
pl: Pobieranie kolejnych rzeczy podanych na wejściu i konstruowanie wartości.

source: These functions are useful when creating your own extensions functions and methods. Additional information and examples are available in :ref:`extending-index`.
pl: Te działania są użyteczne przy tworzeniu swoich własnych zadań rozszerzających i rozszerzających sposobów działania. Dodatkowe informacje i przykłady dostępne są w :ref:`extending-index`.

source: The first three of these functions described, :cfunc:`PyArg_ParseTuple`, :cfunc:`PyArg_ParseTupleAndKeywords`, and :cfunc:`PyArg_Parse`, all use *format strings* which are used to tell the function about the expected arguments. The format strings use the same syntax for each of these functions.
pl: Te pierwsze trzy z opisanych działań, :cfunc:`PyArg_ParseTuple`,:cfunc:`PyArg_ParseTupleAndKeywords`, i:cfunc:`PyArg_Parse`, wszystkie posługują się instrukcjami kształtującymi sposób pobierania rzeczy na wejściu zawartymi w "napisach kształtujących", które są używane, aby przekazać dla zadania wskazówki wyjaśniające oczekiwany charakter wprowadzanych rzeczy. Zapisy kształtujące używają tej samej składni dla każdego z tych zadań.

source: Parsing arguments
pl: Przetwarzanie rzeczy wchodzących

source: A format string consists of zero or more "format units." A format unit describes one Python object; it is usually a single character or a parenthesized sequence of format units. With a few exceptions, a format unit that is not a parenthesized sequence normally corresponds to a single address argument to these functions. In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that matches the format unit; and the entry in [square] brackets is the type of the C variable(s) whose address should be passed.
pl: napis kształtujący może być pusty lub składać się z "jednostek kształtujących". Jednostka ukształtowania opisuje jeden pytonowski przedmiot; jest to zazwyczaj jedna litera, lub kolejką jednostek ukształtowania w ujętych w nawias. Z kilkoma wyjątkami, jednostka ukształtowania, która nie jest kolejką jednostek ujętą w nawias zwykle odpowiada pojedynczo umiejscowionej rzeczy przekazywanej dla tych zadań. W poniższych zapisach cytat jest jednostką kształtującą; polecenie ujęte w nawias okrągły ( ) oznacza typ przedmiotu w języku pytonowskim, który odpowiada jednostce kształtującej, a zapis ujęty w nawiasie kwadratowym [ ] określa typ przedmiotu / przedmiotów w języku C, którego miejsce powinno zostać wskazane i przekazane dla zadania.

source: Strings and buffers
pl: Napisy i skrzynki wymiany

source: These formats do not expect you to provide raw storage for the returned string or bytes. Also, you won't have to release any memory yourself, except with the ``es``, ``es#``, ``et`` and ``et#`` formats.
pl: Dla tych formatów nie musisz zapewniać miejsca dla zwracanych ciągów znaków lub bajtów. Nie musisz też zwalniać żadnej pamięci własnoręcznie, z wyjątkiem tych w formatach ``es``, ``es#``, ``et`` i ``et#``

source: However, when a :ctype:`Py_buffer` structure gets filled, the underlying buffer is locked so that the caller can subsequently use the buffer even inside a :ctype:`Py_BEGIN_ALLOW_THREADS` block without the risk of mutable data being resized or destroyed. As a result, **you have to call** :cfunc:`PyBuffer_Release` after you have finished processing the data (or in any early abort case).
pl: Jednak, gdy struktura :ctype:`Py_buffer` zostanie zapełniona, leżący u podłoża bufor zostaje zablokowany, tak że wywołujący może ponownie użyć bufora nawet wewnątrz bloku :ctype:`Py_BEGIN_ALLOW_THREADS` bez ryzyka zmiany rozmiaru lub skasowania zmienialnych danych. W wyniku tego **trzeba wywołać** :cfunc: `PyBuffer_Release` po zakończeniu przetwarzania danych (lub w przypadku przedwczesnego przerwania).

source: Unless otherwise stated, buffers are not NUL-terminated.
pl: Bufory nie są zakończone znakiem NULL, chyba że zaznaczono inaczej.

source: For all ``#`` variants of formats (``s#``, ``y#``, etc.), the type of the length argument (int or :ctype:`Py_ssize_t`) is controlled by defining the macro :cmacro:`PY_SSIZE_T_CLEAN` before including :file:`Python.h`. If the macro was defined, length is a :ctype:`Py_ssize_t` rather than an :ctype:`int`. This behavior will change in a future Python version to only support :ctype:`Py_ssize_t` and drop :ctype:`int` support. It is best to always define :cmacro:`PY_SSIZE_T_CLEAN`.
pl: Dla wszystkich wariantów ``#`` formatów (``s#``,``y#``, itp.) typ argumentu długości (int lub :ctype: `Py_ssize_t`) jest kontrolowany przez zdefiniowanie makra :cmacro:`PY_SSIZE_T_CLEAN` przed załączeniem pliku :file:`Python.h`. Jeśli makro zostało zdefiniowane, długość jest typu :ctype:`Py_ssize_t` zamiast :ctype:`int`. Ta sytuacja zostanie zmieniona w przyszłych wersjach Pythona, które wspierać będą już tylko :ctype: `Py_ssize_t`, pomijać zaś wsparcie dla :ctype:`int`. Najlepiej zawsze definiować :cmacro:`PY_SSIZE_T_CLEAN`.

source: Convert a Unicode object to a C pointer to a character string. A pointer to an existing string is stored in the character pointer variable whose address you pass. The C string is NUL-terminated. The Python string must not contain embedded NUL bytes; if it does, a :exc:`TypeError` exception is raised. Unicode objects are converted to C strings using ``'utf-8'`` encoding. If this conversion fails, a :exc:`UnicodeError` is raised.
pl: Zamień obiekt Unicode na wskaźnik C do ciągu znaków.Wskaźnik na istniejący ciąg znaków jest przechowywany w zmiennej wskaźnikowej której adres przekazujesz. Ciąg znaków C jest zakończony zerem. Ciąg znaków Pythona nie może zawierać wewnętrznych bajtów równych zero; Jeśli zawiera, zgłaszany jest wyjątek :exc:`TypeError`. Obiekt Unicode jest zamieniany na ciąg znaków C używając kodowania ``'uft-8'``. Jeśli ta konwersja zawiedzie, wyjątek :exc:`UnicodeError` jest zgłaszany.

source: This format does not accept bytes-like objects. If you want to accept filesystem paths and convert them to C character strings, it is preferrable to use the ``O&`` format with :cfunc:`PyUnicode_FSConverter` as *converter*.
pl: Ten format nie akceptuje bajtowych obiektów. jeśli chcesz akceptować ścieżki systemowe i konwertować je do ciągów znakowych z języka C, zalecane jest używanie formatu ``O&`` z funkcją :cfunc:`PyUnicode_FSConverter` jako *konwerterem* formatu.

source: This format accepts Unicode objects as well as objects supporting the buffer protocol. It fills a :ctype:`Py_buffer` structure provided by the caller. In this case the resulting C string may contain embedded NUL bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
pl: Ten format akceptuje obiekty Unicode w równym stopniu jak obiekty wspierające protokół buforowy. Wypełnia on strukturę :ctype:`Py_buffer` dostarczaną przez wywołującego. W tym przypadku wynikowy ciąg znaków języka C może zawierać osadzone znaki NUL. Obiekty Unicode są konwertowane do ciągów znaków języka C używając kodowania ``'utf-8'``.

source: Like ``s*``, except that it doesn't accept mutable buffer-like objects such as :class:`bytearray`. The result is stored into two C variables, the first one a pointer to a C string, the second one its length. The string may contain embedded null bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
pl: Podobnie do ``s*`` z tą różnicą, że nie są akceptowane obiekty zmienne, z natury podobne do buforów, takie jak :class:`bytearray`. Wynik jest przechowywany w dwóch zmiennych języka C, pierwszej będącej wskaźnikiem na ciąg znaków języka C i drugiej będącej jego długością. Ciąg znaków może zawierać osadzone znaki null. Obiekty Unicode są konwertowane do ciągów znaków języka C przy użyciu kodowania ``'utf-8'``.

source: Like ``s``, but the Python object may also be ``None``, in which case the C pointer is set to *NULL*.
pl: Jak ``s``, ale obiekt Pythona może też być żaden - ``None``, a w takim przypadku wskaźnik C jest ustawiony na *NULL*.

source: Like ``s*``, but the Python object may also be ``None``, in which case the ``buf`` member of the :ctype:`Py_buffer` structure is set to *NULL*.
pl: Jak ``s*``, ale obiekt Pythona może też być ``None``, a w takim przypadku członek ``buf`` struktury :ctype:`Py_buffer` jest ustawiony na *NULL*.

source: Like ``s#``, but the Python object may also be ``None``, in which case the C pointer is set to *NULL*.
pl: Jak ``s#``, ale obiekt z języka Python może też być ``None``, a w takim przypadku wskaźnik z języka C jest ustawiany na *NULL*.

source: This format converts a bytes-like object to a C pointer to a character string; it does not accept Unicode objects. The bytes buffer must not contain embedded NUL bytes; if it does, a :exc:`TypeError` exception is raised.
pl: Ten format konwertuje obiekt bajtowy na wskaźnik z języka C wskazujący na ciąg znaków; Nie akceptuje obiektów Unicode. Bufor bajtowy nie może zawierać znaków NUL; jeśli zawiera, zgłaszany jest wyjątek :exc:`TypeError`.

source: This variant on ``s*`` doesn't accept Unicode objects, only objects supporting the buffer protocol. **This is the recommended way to accept binary data.**
pl: Ten wariant ``s*`` nie akceptuje obiektów Unicode, tylko obiekty wspierające protokół bufora. **Jest to zalecany sposób, akceptowania danych binarnych.**

source: This variant on ``s#`` doesn't accept Unicode objects, only bytes-like objects.
pl: Ten wariant ``s#`` nie akceptuje obiektów Unicode, a jedynie bajto-podobne obiekty.

source: Requires that the Python object is a :class:`bytes` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a bytes object. The C variable may also be declared as :ctype:`PyObject\*`.
pl: Wymaga, aby obiekt Pythona był obiektem klasy :class:`bytes` bez podejmowania próby żadnej konwersji. Zgłasza :exc:`TypeError`, jeśli obiekt nie jest obiektem bajtowym. Zmienna C może również zostać zadeklarowana jako :ctype:`PyObject\*`.

source: Requires that the Python object is a :class:`bytearray` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a :class:`bytearray` object. The C variable may also be declared as :ctype:`PyObject\*`.
pl: Wymaga, aby obiekt Pythona był obiektem klasy :class:`bytearray` bez podejmowania prób konwersji. Zgłasza :exc:`TypeError`, jeśli obiekt nie jest obiektem klasy :class:`bytearray`. Zmienna C może również zostać zadeklarowana jako :CType:`PyObject\*`.

source: Convert a Python Unicode object to a C pointer to a NUL-terminated buffer of Unicode characters. You must pass the address of a :ctype:`Py_UNICODE` pointer variable, which will be filled with the pointer to an existing Unicode buffer. Please note that the width of a :ctype:`Py_UNICODE` character depends on compilation options (it is either 16 or 32 bits). The Python string must not contain embedded NUL characters; if it does, a :exc:`TypeError` exception is raised.
pl: Konwertuje obiekt w formacie Unicode Pythona do wskaźnika C na zakończony znakiem NUL bufor znaków Unicode. Trzeba przekazać adres zmiennej wskaźnikowej :ctype:`Py_UNICODE`, która zostanie zapełniona wskaźnikiem do istniejącego buforu Unicode. Zwróć uwagę, że szerokość znaku :ctype:`Py_UNICODE` zależy od opcji kompilacji (jest to albo 16 albo 32 bity). Łańcuch znaków Pythona nie może zawierać osadzonych znaków NUL, jeśli zawiera, to zgłaszany jest wyjątek :exc:`TypeError`.

source: Since ``u`` doesn't give you back the length of the string, and it may contain embedded NUL characters, it is recommended to use ``u#`` or ``U`` instead.
pl: Ponieważ ``u`` nie zwraca długości łańcucha znaków, i może zawierać osadzone znaki NUL, zaleca się zamiast tego stosowanie ``u#`` lub ``U``.

source: This variant on ``u`` stores into two C variables, the first one a pointer to a Unicode data buffer, the second one its length.
pl: Ten wariant ``u`` zapisuje w dwóch zmiennych C, w pierwszej - wskaźnik do bufora danych Unicode, w drugiej - jego długość.

source: Like ``u``, but the Python object may also be ``None``, in which case the :ctype:`Py_UNICODE` pointer is set to *NULL*.
pl: Jak ``u``, ale obiekt Pythona może również być ``None``, a w takim przypadku wskaźnik :ctype:`Py_UNICODE` jest ustawiony na *NULL*.

source: Like ``u#``, but the Python object may also be ``None``, in which case the :ctype:`Py_UNICODE` pointer is set to *NULL*.
pl: Podobnie, jak ``u#``, ale obiekt Pythona może być również ``None``, a w takim przypadku wskaźnik :ctype:`Py_UNICODE`. jest ustawiony na *NULL*.

source: Requires that the Python object is a Unicode object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a Unicode object. The C variable may also be declared as :ctype:`PyObject\*`.
pl: Wymaga, aby obiekt Pythona był obiektem Unicode, bez podejmowania prób konwersji. Zgłasza wyjątek :exc:`TypeError`, jeśli obiekt nie jest obiektem Unicode. Zmienna C może również być zadeklarowana jako :ctype:`PyObject\*`.

source: This format accepts any object which implements the read-write buffer interface. It fills a :ctype:`Py_buffer` structure provided by the caller. The buffer may contain embedded null bytes. The caller have to call :cfunc:`PyBuffer_Release` when it is done with the buffer.
pl: Format ten akceptuje dowolne obiekty implementujące interfejs odczytu i zapisu do bufora. Wypełnia strukturę: ctype:`Py_buffer`, dostarczoną przez wołającego. Bufor może zawierać osadzone znaki null. Wywołujący musi odwołać się do funkcji :cfunc:`PyBuffer_Release`, gdy zakończy pracę z buforem.

source: This variant on ``s`` is used for encoding Unicode into a character buffer. It only works for encoded data without embedded NUL bytes.
pl: Ten wariant ``s`` jest używany do zakodowania Unicode w buforze znaków. To działa tylko dla zakodowanych danych bez osadzonych znaków NUL.

source: This format requires two arguments. The first is only used as input, and must be a :ctype:`const char\*` which points to the name of an encoding as a NUL-terminated string, or *NULL*, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :ctype:`char\*\*`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument.
pl: Ten format wymaga dwóch argumentów. Pierwszy z nich jest używany tylko jako wejście, i musi być typu :ctype:`const char\*` i wskazywać na nazwę kodowania jako ciąg zakończony znakiem NUL, lub *NULL*, w przypadku którego używane jest kodowanie ``'utf-8'``. Jeśli nazwa kodowania nie jest znana w języku Python Zgłaszany jest wyjątek. Drugim argumentem musi być wskaźnik :ctype:`char\*\*`; wartość wskaźnika do którego się odnosi będzie ustawiona na bufor z treścią tekstu argumentu. Tekst zostanie zakodowany w kodowaniu określonym przez pierwszy argument.

source: :cfunc:`PyArg_ParseTuple` will allocate a buffer of the needed size, copy the encoded data into this buffer and adjust *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :cfunc:`PyMem_Free` to free the allocated buffer after use.
pl: Funkcja :cfunc:`PyArg_ParseTuple` alokuje bufor o wymaganym rozmiarze, kopiuje zakodowane dane do tego bufora i ustawia *\*bufor*, aby odwoływał się do nowo przydzielonej pamięci. Wywołujący jest odpowiedzialny za odwołanie się do funkcji :cfunc: `PyMem_Free`, w celu uwolnienia przydzielonej pamięciu bufora po jego użyciu.

source: Same as ``es`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
pl: Podobnie jak ``es`` z wyjątkiem tego, że obiekty ciągów znaków są przekazywane dalej bez ich zapisywania. Zamiast tego implementacja zakłada, że obiekt łańcucha znaków wykorzystuje kodowanie przekazane jako parametr.

source: This variant on ``s#`` is used for encoding Unicode into a character buffer. Unlike the ``es`` format, this variant allows input data which contains NUL characters.
pl: Ten wariant ``s#`` używany jest do kodowania Unicode w buforze znaków. W przeciwieństwie do formatu ``es``, ten wariant pozwala wprowadzać dane zawierające znaki NUL.

source: It requires three arguments. The first is only used as input, and must be a :ctype:`const char\*` which points to the name of an encoding as a NUL-terminated string, or *NULL*, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :ctype:`char\*\*`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument. The third argument must be a pointer to an integer; the referenced integer will be set to the number of bytes in the output buffer.
pl: Wymagane są trzy argumenty. Pierwszy z nich jest używany tylko jako wejście, i musi być typu :ctype:`const char\*`, i wskazywać na nazwę kodowania jako ciąg zakończony znakiem NUL, lub *NULL*, w przypadku którego używane jest kodowanie ``'utf-8'``. Jeśli nazwa kodowania nie jest znana w języku Python, zgłaszany jest wyjątek. Drugim argumentem musi być wskaźnik :ctype:`char\*\*`; Wartością wskaźnika do którego odnosi się ten będzie bufor z zawartością tekstu argumentu. Tekst zostanie zakodowany w kodowaniu określonym przez pierwszy argument. Trzecim argumentem musi być wskaźnik do liczby całkowitej; liczba całkowita, do której się on odwołuje zostanie ustawiona na liczbę znaków w buforze wyjściowym.

source: There are two modes of operation:
pl: Istnieją dwa tryby pracy:

source: If *\*buffer* points a *NULL* pointer, the function will allocate a buffer of the needed size, copy the encoded data into this buffer and set *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :cfunc:`PyMem_Free` to free the allocated buffer after usage.
pl: Jeśli *\*bufor* wskazuje na wskaźnik *NULL*, funkcja zaalokuje bufor o wymaganym rozmiarze, skopiuje zakodowane dane do tego bufora i ustawi *\*bufor* aby odwoływał się do nowo przydzielonej pamięci. Wywołujący jest odpowiedzialny za wywołanie funkcji: cfunc:`PyMem_Free` w celu uwolnienia przydzielonej pamięciu bufora po zakończeniu użycia.

source: If *\*buffer* points to a non-*NULL* pointer (an already allocated buffer), :cfunc:`PyArg_ParseTuple` will use this location as the buffer and interpret the initial value of *\*buffer_length* as the buffer size. It will then copy the encoded data into the buffer and NUL-terminate it. If the buffer is not large enough, a :exc:`ValueError` will be set.
pl: Jeśli *\*bufor* wskazuje na niezerowy wskaźnik (bufor umieszczony już w pamięci), funkcja :cfunc:`PyArg_ParseTuple` użyje tego miejsca jako bufora i zinterpretuje początkową wartość *\*buffer_length* jako rozmiar bufora. Skopiuje potem zakodowane dane do bufora i zakończy znakiem zera. Jeśli bufor nie jest wystarczająco duży, wyjątek :exc:`ValueError` zostanie zgłoszony.

source: In both cases, *\*buffer_length* is set to the length of the encoded data without the trailing NUL byte.
pl: W obu przypadkach, *\*buffer_length* jest ustawiany na długość zakodowanych danych z pominięciem zakańczającego znaku NUL.

source: Same as ``es#`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
pl: Tak samo, jak w ``es#`` oprócz tego, że obiekty ciągu bajtów są przekazywane do funkcji bez ich zapisywania. Zamiast tego, implementacja zakłada że obiekt ciągu bajtów używa kodowania przekazywanego w parametrze.

source: Numbers
pl: Liczby

source: Convert a nonnegative Python integer to an unsigned tiny int, stored in a C :ctype:`unsigned char`.
pl: Przelicza nieujemną liczbę całkowitą języka Python na liczbę całkowitą krótką bez znaku, przechowywaną jako liczbę języka C typu :ctype:`unsigned char`.

source: Convert a Python integer to a tiny int without overflow checking, stored in a C :ctype:`unsigned char`.
pl: Przelicza liczbę całkowitą języka Python na liczbę całkowitą krótką bez sprawdzania czy nie przekroczono zakresu wartości, zachowaną jako liczbę języka C typu :ctype:`unsigned char`.

source: Convert a Python integer to a C :ctype:`short int`.
pl: Przelicza liczbę całkowitą języka Python na liczbę języka C typu :ctype:`short int`.

source: Convert a Python integer to a C :ctype:`unsigned short int`, without overflow checking.
pl: Przelicza liczbę całkowitą języka Python na liczbę języka C typu :ctype:`unsigned short int`, bez sprawdzania czy nie przekroczono zakresu wartości.

source: Convert a Python integer to a plain C :ctype:`int`.
pl: Przelicza liczbę całkowitą języka Python na zwykłą liczbę całkowitą języka C typu :ctype:`int`.

source: Convert a Python integer to a C :ctype:`unsigned int`, without overflow checking.
pl: Przelicza liczbę całkowitą języka Python na liczbę całkowitą języka C typu :ctype:`unsigned int`, bez sprawdzania czy nie przekroczono zakresu wartości.

source: Convert a Python integer to a C :ctype:`long int`.
pl: Przelicza liczbę całkowitą języka Python na liczbę całkowitą języka C typu :ctype:`long int`.

source: Convert a Python integer to a C :ctype:`unsigned long` without overflow checking.
pl: Przelicza liczbę całkowitą języka Python na liczbę całkowitą języka C typu :ctype:`long int` bez sprawdzania czy nie przekroczono zakresu wartości.

source: Convert a Python integer to a C :ctype:`long long`. This format is only available on platforms that support :ctype:`long long` (or :ctype:`_int64` on Windows).
pl: Przelicza liczbę całkowitą języka Python na liczbę całkowitą języka C typu :ctype:`long long` (lub typu :ctype:`_int64` w systemie Windows).
